younghonor/STM32F4-Project/Core/Src/main.c
  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* Peripheral clock enable */
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);

  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);
  /**USART1 GPIO Configuration
  PB7   ------> USART1_RX
  PB6   ------> USART1_TX
  */
  GPIO_InitStruct.Pin = LL_GPIO_PIN_7 | LL_GPIO_PIN_6;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  GPIO_InitStruct.Alternate = LL_GPIO_AF_7;
  LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  USART_InitStruct.BaudRate = 115200;
  USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
  USART_InitStruct.Parity = LL_USART_PARITY_NONE;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
  LL_USART_Init(USART1, &USART_InitStruct);
  LL_USART_ConfigAsyncMode(USART1);
  LL_USART_Enable(USART1);
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */
}

/**
 * @brief USB_OTG_HS Initialization Function
 * @param None
 * @retval None
 */
static void MX_USB_OTG_HS_PCD_Init(void) {

  /* USER CODE BEGIN USB_OTG_HS_Init 0 */

  /* USER CODE END USB_OTG_HS_Init 0 */

  /* USER CODE BEGIN USB_OTG_HS_Init 1 */

  /* USER CODE END USB_OTG_HS_Init 1 */
  hpcd_USB_OTG_HS.Instance = USB_OTG_HS;
  hpcd_USB_OTG_HS.Init.dev_endpoints = 6;
  hpcd_USB_OTG_HS.Init.speed = PCD_SPEED_HIGH;
  hpcd_USB_OTG_HS.Init.dma_enable = DISABLE;
  hpcd_USB_OTG_HS.Init.phy_itface = USB_OTG_ULPI_PHY;
  hpcd_USB_OTG_HS.Init.Sof_enable = DISABLE;
  hpcd_USB_OTG_HS.Init.low_power_enable = DISABLE;
  hpcd_USB_OTG_HS.Init.lpm_enable = DISABLE;
  hpcd_USB_OTG_HS.Init.vbus_sensing_enable = DISABLE;
  hpcd_USB_OTG_HS.Init.use_dedicated_ep1 = DISABLE;
  hpcd_USB_OTG_HS.Init.use_external_vbus = DISABLE;
  if (HAL_PCD_Init(&hpcd_USB_OTG_HS) != HAL_OK) {
    Error_Handler();
  }
  /* USER CODE BEGIN USB_OTG_HS_Init 2 */

  /* USER CODE END USB_OTG_HS_Init 2 */
}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void) {
  LL_GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOE);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOG);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOD);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOI);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOH);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOF);

  /**/
  LL_GPIO_ResetOutputPin(
      GPIOE, MTS_GPIO1_Pin | MTS_GPIO3_Pin | MTS_GPIO5_Pin | MTS_GPIO7_Pin |
                 MTS_GPIO0_Pin | MTS_GPIO2_Pin | MTS_GPIO4_Pin |
                 MTS_VDDIO_SW_Pin | MTS_AVDD_I_SEL_1E8_Pin |
                 MTS_DVDD_I_READ_3_Pin | MTS_DVDD_I_SEL_2_Pin |
                 MTS_VEN_ID_0_Pin | MTS_VEN_ID_1_Pin);

  /**/
  LL_GPIO_ResetOutputPin(GPIOB, MTS_IO_DIR2_Pin | MTS_GPIO6_Pin);

  /**/
  LL_GPIO_ResetOutputPin(
      GPIOG, MTS_LEAK_TEST_SEL2_Pin | MTS_LEAK_TEST_1_Pin | MTS_IO_DIR4_Pin |
                 MTS_Flash_SPI_CS_Pin | MTS_DUT_SPI_CLK_DIR_Pin |
                 MTS_DUT_SPI_SI_DIR_Pin | MTS_DUT_SPI_SO_DIR_Pin |
                 MTS_MODULE_RST_Pin | MTS_IO_VCCB_VDDIO_Pin |
                 MTS_VDDIO_I_READ_1_2_Pin | MTS_DVDD_SW_Pin);

  /**/
  LL_GPIO_ResetOutputPin(GPIOI, MTS_IO_DIR0_Pin | MTS_IO_DIR1_Pin |
                                    MTS_IO_DIR3_Pin | MTS_IO_VCCB_DVDD_Pin |
                                    MTS_SPI2_CS_Pin);

  /**/
  LL_GPIO_ResetOutputPin(GPIOD, MTS_IO_EN_Pin | MTS_SHIFTER1_VCCB_SW_Pin |
                                    MTS_DAC_BSY_Pin | MTS_DAC_LDAC_Pin |
                                    MTS_I2C_EN_Pin | MTS_REV_IO_0_Pin |
                                    MTS_DVDD_I_READ_1_2_Pin | MTS_REV_IO_1_Pin);

  /**/
  LL_GPIO_ResetOutputPin(
      GPIOH, MTS_LPC_nRST_Pin | MTS_LED_R_Pin | MTS_LED_G_Pin |
                 MTS_RST_USB_HS_PHY_Pin | MTS_EN_VPP_IN_Pin | MTS_LPC86_CS_Pin |
                 MTS_LEAK_TEST_SEL3_Pin | MTS_LEAK_TEST_SEL4_Pin |
                 MTS_VDDIO_I_SEL_2_Pin | MTS_VDDIO_I_SEL_1_Pin |
                 MTS_VDDIIO_I_READ_3_Pin | MTS_DUT_SPI_EN__Pin);

  /**/
  LL_GPIO_ResetOutputPin(MTS_DUT_RST_EN_GPIO_Port, MTS_DUT_RST_EN_Pin);

  /**/
  LL_GPIO_ResetOutputPin(GPIOF, MTS_VPP_OUT_Pin | MTS_AVDD_I_SEL_1_Pin |
                                    MTS_AVDD_I_SEL_2_Pin |
                                    MTS_AVDD_I_READ_1_2_Pin | MTS_AVDD_SW_Pin |
                                    MTS_AVDD_I_READ_3_Pin);

  /**/
  LL_GPIO_ResetOutputPin(MTS_SPI3_CS_GPIO_Port, MTS_SPI3_CS_Pin);

  /**/
  GPIO_InitStruct.Pin =
      MTS_GPIO1_Pin | MTS_GPIO3_Pin | MTS_GPIO5_Pin | MTS_GPIO7_Pin |
      MTS_GPIO0_Pin | MTS_GPIO2_Pin | MTS_GPIO4_Pin | MTS_VDDIO_SW_Pin |
      MTS_AVDD_I_SEL_1E8_Pin | MTS_DVDD_I_READ_3_Pin | MTS_DVDD_I_SEL_2_Pin |
      MTS_VEN_ID_0_Pin | MTS_VEN_ID_1_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_IO_DIR2_Pin | MTS_GPIO6_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin =
      MTS_LEAK_TEST_SEL2_Pin | MTS_LEAK_TEST_1_Pin | MTS_IO_DIR4_Pin |
      MTS_Flash_SPI_CS_Pin | MTS_DUT_SPI_CLK_DIR_Pin | MTS_DUT_SPI_SI_DIR_Pin |
      MTS_DUT_SPI_SO_DIR_Pin | MTS_MODULE_RST_Pin | MTS_IO_VCCB_VDDIO_Pin |
      MTS_VDDIO_I_READ_1_2_Pin | MTS_DVDD_SW_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = LL_GPIO_PIN_7 | LL_GPIO_PIN_6 | LL_GPIO_PIN_0 |
                        LL_GPIO_PIN_5 | LL_GPIO_PIN_1 | LL_GPIO_PIN_3 |
                        LL_GPIO_PIN_2 | LL_GPIO_PIN_11;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin =
      LL_GPIO_PIN_15 | LL_GPIO_PIN_12 | LL_GPIO_PIN_11 | LL_GPIO_PIN_9;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_BID0_Pin | MTS_BID1_Pin | MTS_BID2_Pin |
                        MTS_MODULE_INT_Pin | MTS_LPC86_INT_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_HID0_Pin | MTS_HID1_Pin | MTS_HID2_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_IO_DIR0_Pin | MTS_IO_DIR1_Pin | MTS_IO_DIR3_Pin |
                        MTS_IO_VCCB_DVDD_Pin | MTS_SPI2_CS_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_IO_EN_Pin | MTS_SHIFTER1_VCCB_SW_Pin |
                        MTS_DAC_BSY_Pin | MTS_DAC_LDAC_Pin | MTS_I2C_EN_Pin |
                        MTS_REV_IO_0_Pin | MTS_DVDD_I_READ_1_2_Pin |
                        MTS_REV_IO_1_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin =
      MTS_LPC_nRST_Pin | MTS_LED_R_Pin | MTS_LED_G_Pin |
      MTS_RST_USB_HS_PHY_Pin | MTS_EN_VPP_IN_Pin | MTS_LPC86_CS_Pin |
      MTS_LEAK_TEST_SEL3_Pin | MTS_LEAK_TEST_SEL4_Pin | MTS_VDDIO_I_SEL_2_Pin |
      MTS_VDDIO_I_SEL_1_Pin | MTS_VDDIIO_I_READ_3_Pin | MTS_DUT_SPI_EN__Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = LL_GPIO_PIN_2;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_DUT_RST_EN_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(MTS_DUT_RST_EN_GPIO_Port, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = LL_GPIO_PIN_7 | LL_GPIO_PIN_6;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_VPP_OUT_Pin | MTS_AVDD_I_SEL_1_Pin |
                        MTS_AVDD_I_SEL_2_Pin | MTS_AVDD_I_READ_1_2_Pin |
                        MTS_AVDD_SW_Pin | MTS_AVDD_I_READ_3_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = LL_GPIO_PIN_2 | LL_GPIO_PIN_15;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /**/
  GPIO_InitStruct.Pin = MTS_SPI3_CS_Pin;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  LL_GPIO_Init(MTS_SPI3_CS_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const *argument) {
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for (;;) {
    LL_GPIO_TogglePin(MTS_LED_G_GPIO_Port, MTS_LED_G_Pin);
    // osDelay(1000);
    LL_GPIO_TogglePin(MTS_LED_R_GPIO_Port, MTS_LED_R_Pin);
    osDelay(10000);
  }
  /* USER CODE END 5 */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
